TexasInstruments/mcupsdk-core/examples/industrial_comms/ethernetip_adapter_demo/rgmii/am243x-lp/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM243x_ALX_beta" --package "ALX" --part "ALX" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.14.0+2667"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom      = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1     = eeprom.addInstance();
const flash       = scripting.addModule("/board/flash/flash", {}, false);
const flash1      = flash.addInstance();
const led         = scripting.addModule("/board/led/led", {}, false);
const led1        = led.addInstance();
const i2c         = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1        = i2c.addInstance();
const pruicss     = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1    = pruicss.addInstance();
const uart        = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1       = uart.addInstance();
const ethernetip  = scripting.addModule("/industrial_comms/ethernetip/ethernetip", {}, false);
const ethernetip1 = ethernetip.addInstance();
const clock       = scripting.addModule("/kernel/dpl/clock");
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const timer       = scripting.addModule("/kernel/dpl/timer", {}, false);
const timer1      = timer.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

flash1.$name                         = "CONFIG_FLASH0";
flash1.flashQeType                   = "5";
flash1.peripheralDriver.$name        = "CONFIG_OSPI0";
flash1.peripheralDriver.OSPI.$assign = "OSPI0";

led1.$name = "CONFIG_LED0";
led1.name  = "TPIC2810";

i2c1.$name               = "CONFIG_I2C0";
led1.peripheralDriver    = i2c1;
eeprom1.peripheralDriver = i2c1;
i2c1.I2C.$assign         = "I2C0";

uart1.$name                   = "CONFIG_UART1";
uart1.intrEnable              = "USER_INTR";
uart1.rxTrigLvl               = "1";
uart1.useMcuDomainPeripherals = true;
uart1.MCU_UART.$assign        = "MCU_USART0";

ethernetip1.$name                         = "CONFIG_ETHERNETIP0";
ethernetip1.phyAddr0                      = 3;
ethernetip1.phyAddr1                      = 15;
ethernetip1.phyToMacInterfaceMode         = "RGMII";
ethernetip1.mdioManualModeLinkPolling     = "MLINK";
ethernetip1.icss_emac[0].$name            = "CONFIG_ICSS_EMAC0";
ethernetip1.icss_emac[0].mode             = scripting.forceWrite("SWITCH");
ethernetip1.icss_emac[0].learningEnable   = true;
ethernetip1.icss_emac[0].linkTaskPriority = 24;
ethernetip1.icss_emac[0].rxTaskPriority   = 20;
ethernetip1.icss_emac[0].txTaskPriority   = 20;
ethernetip1.ethphy1[0].$name              = "CONFIG_ETHPHY0";
ethernetip1.ethphy1[0].name               = "CUSTOM";
ethernetip1.ethphy1[0].customDeviceName   = "DP83869_0";
ethernetip1.ethphy2[0].$name              = "CONFIG_ETHPHY1";
ethernetip1.ethphy2[0].name               = "CUSTOM";
ethernetip1.ethphy2[0].customDeviceName   = "DP83869_1";

ethernetip1.icss                         = pruicss1;
pruicss1.$name                           = "CONFIG_PRU_ICSS1";
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

debug_log.enableUartLog        = true;
debug_log.uartLog.$name        = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign = "USART0";

mpu_armv71.$name        = "CONFIG_MPU_REGION0";
mpu_armv71.size         = 31;
mpu_armv71.attributes   = "Device";
mpu_armv71.allowExecute = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv75.$name      = "CONFIG_MPU_REGION4";
mpu_armv75.size       = 16;
mpu_armv75.baseAddr   = 0x70000000;
mpu_armv75.attributes = "Cached+Sharable";

timer1.$name         = "CONFIG_TIMER0";
timer1.startTimer    = true;
timer1.timerCallback = "OSAL_FREERTOS_callbackTimer";
timer1.TIMER.$assign = "DMTIMER4";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.CLK.$suggestSolution            = "OSPI0_CLK";
flash1.peripheralDriver.OSPI.CSn0.$suggestSolution           = "OSPI0_CSn0";
flash1.peripheralDriver.OSPI.D3.$suggestSolution             = "OSPI0_D3";
flash1.peripheralDriver.OSPI.D2.$suggestSolution             = "OSPI0_D2";
flash1.peripheralDriver.OSPI.D1.$suggestSolution             = "OSPI0_D1";
flash1.peripheralDriver.OSPI.D0.$suggestSolution             = "OSPI0_D0";
i2c1.I2C.SCL.$suggestSolution                                = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution                                = "I2C0_SDA";
uart1.MCU_UART.RXD.$suggestSolution                          = "MCU_UART0_RXD";
uart1.MCU_UART.TXD.$suggestSolution                          = "MCU_UART0_TXD";
ethernetip1.PRU_ICSSG1_MDIO.$suggestSolution                 = "PRU_ICSSG1_MDIO0";
ethernetip1.PRU_ICSSG1_MDIO.MDC.$suggestSolution             = "PRG1_MDIO0_MDC";
ethernetip1.PRU_ICSSG1_MDIO.MDIO.$suggestSolution            = "PRG1_MDIO0_MDIO";
ethernetip1.PRU_ICSSG1_IEP.$suggestSolution                  = "PRU_ICSSG1_IEP0";
ethernetip1.PRU_ICSSG1_IEP.EDC_LATCH_IN0.$suggestSolution    = "PRG1_PRU0_GPO18";
ethernetip1.PRU_ICSSG1_IEP.EDC_SYNC_OUT0.$suggestSolution    = "PRG1_PRU0_GPO19";
ethernetip1.PRU_ICSSG1_RGMII1.$suggestSolution               = "PRU_ICSSG1_RGMII2";
ethernetip1.PRU_ICSSG1_RGMII1.RD0.$suggestSolution           = "PRG1_PRU1_GPO0";
ethernetip1.PRU_ICSSG1_RGMII1.RD1.$suggestSolution           = "PRG1_PRU1_GPO1";
ethernetip1.PRU_ICSSG1_RGMII1.RD2.$suggestSolution           = "PRG1_PRU1_GPO2";
ethernetip1.PRU_ICSSG1_RGMII1.RD3.$suggestSolution           = "PRG1_PRU1_GPO3";
ethernetip1.PRU_ICSSG1_RGMII1.RXC.$suggestSolution           = "PRG1_PRU1_GPO6";
ethernetip1.PRU_ICSSG1_RGMII1.RX_CTL.$suggestSolution        = "PRG1_PRU1_GPO4";
ethernetip1.PRU_ICSSG1_RGMII1.TD0.$suggestSolution           = "PRG1_PRU1_GPO11";
ethernetip1.PRU_ICSSG1_RGMII1.TD1.$suggestSolution           = "PRG1_PRU1_GPO12";
ethernetip1.PRU_ICSSG1_RGMII1.TD2.$suggestSolution           = "PRG1_PRU1_GPO13";
ethernetip1.PRU_ICSSG1_RGMII1.TD3.$suggestSolution           = "PRG1_PRU1_GPO14";
ethernetip1.PRU_ICSSG1_RGMII1.TXC.$suggestSolution           = "PRG1_PRU1_GPO16";
ethernetip1.PRU_ICSSG1_RGMII1.TX_CTL.$suggestSolution        = "PRG1_PRU1_GPO15";
ethernetip1.PRU_ICSSG1_RGMII2.$suggestSolution               = "PRU_ICSSG1_RGMII1";
ethernetip1.PRU_ICSSG1_RGMII2.RD0.$suggestSolution           = "PRG1_PRU0_GPO0";
ethernetip1.PRU_ICSSG1_RGMII2.RD1.$suggestSolution           = "PRG1_PRU0_GPO1";
ethernetip1.PRU_ICSSG1_RGMII2.RD2.$suggestSolution           = "PRG1_PRU0_GPO2";
ethernetip1.PRU_ICSSG1_RGMII2.RD3.$suggestSolution           = "PRG1_PRU0_GPO3";
ethernetip1.PRU_ICSSG1_RGMII2.RXC.$suggestSolution           = "PRG1_PRU0_GPO6";
ethernetip1.PRU_ICSSG1_RGMII2.RX_CTL.$suggestSolution        = "PRG1_PRU0_GPO4";
ethernetip1.PRU_ICSSG1_RGMII2.TD0.$suggestSolution           = "PRG1_PRU0_GPO11";
ethernetip1.PRU_ICSSG1_RGMII2.TD1.$suggestSolution           = "PRG1_PRU0_GPO12";
ethernetip1.PRU_ICSSG1_RGMII2.TD2.$suggestSolution           = "PRG1_PRU0_GPO13";
ethernetip1.PRU_ICSSG1_RGMII2.TD3.$suggestSolution           = "PRG1_PRU0_GPO14";
ethernetip1.PRU_ICSSG1_RGMII2.TXC.$suggestSolution           = "PRG1_PRU0_GPO16";
ethernetip1.PRU_ICSSG1_RGMII2.TX_CTL.$suggestSolution        = "PRG1_PRU0_GPO15";
ethernetip1.PRU_ICSSG1_MII_G_RT.$suggestSolution             = "PRU_ICSSG1_MII_G_RT";
ethernetip1.PRU_ICSSG1_MII_G_RT.MII0_RXLINK.$suggestSolution = "PRG1_PRU0_GPO8";
ethernetip1.PRU_ICSSG1_MII_G_RT.MII1_RXLINK.$suggestSolution = "PRG1_PRU1_GPO8";
debug_log.uartLog.UART.RXD.$suggestSolution                  = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution                  = "UART0_TXD";
